К = int( input( 'Введите количество баллов:' ) )
norm_a = [ 90, 100 ]
norm_b = [ 75,  89 ]
norm_c = [ 60,  74 ]
norm_p = [  0,  59 ]

if   norm_a[0] <= К <= norm_a[1] :
  print( 'A' )
elif norm_b[0] <= К <= norm_b[1] :
  print( 'B' )
elif norm_c[0] <= К <= norm_c[1] :
  print( 'C' )
elif norm_p[0] <= К <= norm_p[1] :
  print( 'Провал' )

# Напишите программу
# Дано целое число К в диапазоне 0–100
# Вывести описание оценки:
# «А»     90 - 100
# «В»     75 -  89
# «С»     60 -  74
# «Провал» 0 -  59
